var map = [
[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
[1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1],
[1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,0,1],
[1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,0,1],
[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
[1,0,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,0,1],
[1,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,1],
[1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1],
[1,2,2,1,0,1,0,0,0,0,0,0,0,1,0,1,2,2,1],
[1,1,1,1,0,1,0,1,1,2,1,1,0,1,0,1,1,1,1],
[0,0,0,0,0,0,0,1,2,3,2,1,0,0,0,0,0,0,0],
[1,1,1,1,0,1,0,1,1,2,1,1,0,1,0,1,1,1,1],
[1,2,2,1,0,1,0,0,0,0,0,0,0,1,0,1,2,2,1],
[1,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1],
[1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1],
[1,0,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,0,1],
[1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1],
[1,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,0,1,1],
[1,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,1],
[1,0,1,1,1,1,1,1,0,1,0,1,1,1,1,1,1,0,1],
[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
];

window.onload = function(){
	
	drawMap();

}


function drawMap(){


	var canvas = document.querySelector('#myCanvas');
	var ctx = canvas.getContext('2d');

	var imageObj = new Image();
	imageObj.src = "assets/pacman.png";

	var lc = canvas.height;
	var lg = canvas.width;


	//taille tableau +1 pour afficher tous les côtés
	var lcc = lc/22;
	var lgc = lg/20;

	var posX = 0;
	var posY = 0;

	for (var i = 0; i < map.length; i++) {
		posX+=lgc;
			for (var j = 0; j < map.length; j++) {
				

				if(map[j][i] == 1)
				{
					ctx.fillStyle = "blue";
					ctx.fillRect(posX,posY,30,30);
					//console.log("salut!");
				}

				if(map[j][i] == 0)
				{
					ctx.fillStyle = "orange";
					ctx.beginPath();
					ctx.arc(posX + 15, posY + 15, 3, 0, 2 * Math.PI);
					ctx.fill();
				}

				if(map[j][i] == 3)
				{
					ctx.drawImage(imageObj, posX, posY);
				}			

				posY+=lcc;

			}
			posY = 0;
	}
}